# How to concate dataframes

## Suppose we have two dataframes as below

In [7]:
import pandas as pd

In [8]:
df_1 = pd.DataFrame()
df_1['id'] = [i for i in range(1, 4)]
df_1['Name'] = ['A', 'B', 'C']
df_1

   id Name
0   1    A
1   2    B
2   3    C

In [9]:
df_2 = pd.DataFrame()
df_2['id'] = [i for i in range(4, 8)]
df_2['Name'] = ['M', 'K', 'H', 'I']
df_2

   id Name
0   4    M
1   5    K
2   6    H
3   7    I

In [10]:
# Concate along the row axis (axis = 0)
pd.concat([df_1, df_2], axis=0)

   id Name
0   1    A
1   2    B
2   3    C
0   4    M
1   5    K
2   6    H
3   7    I

In [11]:
# Concate along the column axis (axis = 1)
pd.concat([df_1, df_2], axis=1)

    id Name  id Name
0  1.0    A   4    M
1  2.0    B   5    K
2  3.0    C   6    H
3  NaN  NaN   7    I